fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ВКМ_НачислениеФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированнойПремии</name>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ДополнительныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчетаБаза</name>
    <type>
      <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      <types>ChartOfCalculationTypesRef.ВКМ_ДополнительныеНачисления</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВКМ_СпособРасчета/ВКМ_СпособРасчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_СпособРасчета</name>
  <enumValues>
    <name>ФиксированнаяСумма</name>
  </enumValues>
  <enumValues>
    <name>ПроцентОтРабот</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>СУчетомГрафикаРабот</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/ChartsOfCalculationTypes/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ДополнительныеНачисления</name>
  <predefined>
    <items>
      <name>ПроцентОтРабот</name>
      <description>Процент от работ</description>
    </items>
    <items>
      <name>ФиксированнаяПремия</name>
      <description>Фиксированная премия</description>
    </items>
  </predefined>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.ВКМ_СпособРасчета</types>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = Пользователи.ТекущийПользователь();  
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СформироватьДвижения(); 
	
	ПроведениеПоРегиструВзаиморасчетыССотрудниками();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура СформироватьДвижения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_НачислениеФиксированнойПремииНачисления.Сотрудник КАК Сотрудник,
	               |	ВКМ_НачислениеФиксированнойПремииНачисления.ВидРасчета КАК ВидРасчета,
	               |	ВКМ_НачислениеФиксированнойПремииНачисления.Размер КАК Размер,
	               |	ВКМ_НачислениеФиксированнойПремииНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета
	               |ИЗ
	               |	Документ.ВКМ_НачислениеФиксированнойПремии.Начисления КАК ВКМ_НачислениеФиксированнойПремииНачисления
	               |ГДЕ
	               |	ВКМ_НачислениеФиксированнойПремииНачисления.Ссылка = &Ссылка";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();	
	
	
	Пока Выборка.Следующий() Цикл
		
		// регистр ВКМ_ДополнительныеНачисления
		Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
		Если ТипЗнч(Выборка.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления") Тогда	
			
			Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить(); 
			Если Выборка.СпособРасчета = Перечисления.ВКМ_СпособРасчета.ФиксированнаяСумма Тогда
				
				Движение.Сторно = Ложь;
				Движение.ВидРасчета = Выборка.ВидРасчета;
				Движение.ПериодРегистрации = Дата;
				Движение.Сотрудник = Выборка.Сотрудник;
				Движение.Размер = Выборка.Размер;
				движение.Результат = Выборка.Размер; 
				
				//Сразу добавим удержание НДФЛ  
				ПроцентНДФЛ = 13;
				Движение = Движения.ВКМ_Удержания.Добавить();
				Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
				Движение.ПериодРегистрации = Дата;
				Движение.Сотрудник = Выборка.Сотрудник;
				Движение.Размер = Выборка.Размер; 
				Движение.ВидРасчетаБаза = Выборка.ВидРасчета; 
				Движение.Результат = Движение.Размер*ПроцентНДФЛ/100;
			КонецЕсли;	 
			
		КонецЕсли;

			
	КонецЦикла;

	Движения.ВКМ_Удержания.Записать();
	Движения.ВКМ_ДополнительныеНачисления.Записать();
КонецПроцедуры


Процедура ПроведениеПоРегиструВзаиморасчетыССотрудниками() 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
	               |	ВКМ_ДополнительныеНачисления.Результат КАК Начислено
	               |ПОМЕСТИТЬ ВТ_Начисления
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	               |ГДЕ
	               |	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВКМ_Удержания.Сотрудник КАК Сотрудник,
	               |	ВКМ_Удержания.Результат КАК Удержано
	               |ПОМЕСТИТЬ ВТ_Удержено
	               |ИЗ
	               |	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	               |ГДЕ
	               |	ВКМ_Удержания.Регистратор = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВКМ_Удержания.Сотрудник,
	               |	ВКМ_Удержания.Результат
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Начисления.Сотрудник КАК Сотрудник,
	               |	СУММА(ВТ_Начисления.Начислено) КАК Начислено,
	               |	СУММА(ВТ_Удержено.Удержано) КАК Удержано
	               |ИЗ
	               |	ВТ_Начисления КАК ВТ_Начисления
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Удержено КАК ВТ_Удержено
	               |		ПО ВТ_Начисления.Сотрудник = ВТ_Удержено.Сотрудник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Начисления.Сотрудник";
	
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Пока  Выборка.Следующий() Цикл 
		 Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
		 Движение.Период = Дата;
		 Движение.Сотрудник = Выборка.Сотрудник;
		 Движение.Сумма = Выборка.Начислено - Выборка.Удержано;  
	 КонецЦикла;	

	
	
КонецПроцедуры	

Процедура ВыполнитьАвтозаполнение(Премия)  Экспорт 
	
	Начисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ФизическиеЛица.Ссылка КАК Сотрудник
	               |ИЗ
	               |	Справочник.ВКМ_ФизическиеЛица КАК ВКМ_ФизическиеЛица
	               |ГДЕ
	               |	НЕ ВКМ_ФизическиеЛица.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл     
		НоваяСтрока = Начисления.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		НоваяСтрока.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия; 
		НоваяСтрока.Размер = Премия;
	КонецЦикла;	
	
КонецПроцедуры	
#КонецОбласти


#КонецЕсли
